Belajar grouping(Pengelompokan)

Pengenalan

Peta memungkinkan kita mengubah data dalam nilai DataFrame atau Seri satu per satu untuk seluruh kolom. Namun, sering kali kita ingin mengelompokkan data kita, lalu melakukan sesuatu yang spesifik pada kelompok data tersebut.

Seperti yang akan Anda pelajari, kami melakukan ini dengan operasi groupby(). Kami juga akan membahas beberapa topik tambahan, seperti cara yang lebih kompleks untuk mengindeks DataFrames Anda, serta cara mengurutkan data Anda.

In [1]:
# memperisapkan module yang perlu diperlukan
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Matplotlib is building the font cache; this may take a moment.

In [2]:
# mempersiapkan dataset yang diperlukan
Dataset = pd.read_csv('C:\Latihan\Latihan\Python\Sample Data\olympics2024.csv')
Dataset

    Rank        Country Country Code  Gold  Silver  Bronze  Total
0      1  United States           US    40      44      42    126
1      2          China          CHN    40      27      24     91
2      3          Japan          JPN    20      12      13     45
3      4      Australia          AUS    18      19      16     53
4      5         France          FRA    16      26      22     64
..   ...            ...          ...   ...     ...     ...    ...
86    84           Peru          PER     0       0       1      1
87    84          Qatar          QAT     0       0       1      1
88    84      Singapore          SIN     0       0       1      1
89    84       Slovakia          SVK     0       0       1      1
90    84         Zambia          ZAM     0       0       1      1

[91 rows x 7 columns]

1. Groupwise analysis / Analisis kelompok

Salah satu fungsi yang sering kami gunakan sejauh ini adalah fungsi value_counts(). Kita dapat meniru apa yang dilakukan value_counts() dengan melakukan hal berikut:

In [3]:
# contoh 1
Dataset.groupby('Total').Total.count()
# sintaks ini digunakan untuk menghasilkan jumlah kemunculan dari setiap nilai unik yang ada di kolom Total 
# dalam dataframe Dataset.

Total
1      15
2      11
3       8
4       9
5       5
6       6
7       8
8       4
9       3
10      2
11      2
12      2
13      1
18      1
19      1
20      2
27      1
32      1
33      1
34      1
40      1
45      1
53      1
64      1
65      1
91      1
126     1
Name: Total, dtype: int64

groupby() membuat grup ulasan yang memberikan nilai poin yang sama ke total pemberian. Kemudian, untuk masing-masing grup ini, kami mengambil kolom points() dan menghitung berapa kali kolom tersebut muncul. value_counts() hanyalah jalan pintas ke operasi groupby() ini.

Kita dapat menggunakan salah satu fungsi ringkasan yang telah kita gunakan sebelumnya dengan data ini. Misalnya, untuk mendapatkan total terkecil di setiap kategori nilai poin, kita dapat melakukan hal berikut:

In [7]:
# contoh 2

Dataset.groupby('Country').Total.min()

Country
Albania            2
Algeria            3
Argentina          3
Armenia            4
Australia         53
                ...
Uganda             2
Ukraine           12
United States    126
Uzbekistan        13
Zambia             1
Name: Total, Length: 91, dtype: int64

2. Multi-indexes

Dalam semua contoh yang telah kita lihat sejauh ini, kita telah bekerja dengan objek DataFrame atau Series dengan indeks label tunggal. groupby() sedikit berbeda karena, bergantung pada operasi yang kita jalankan, terkadang akan menghasilkan apa yang disebut multi-indeks.

Multi-indeks berbeda dari indeks biasa karena memiliki beberapa tingkatan. Misalnya:

In [14]:
# contoh 3

Data_Country = Dataset.groupby(['Country', 'Total']).size()
Data_Country
# sintaks diatas digunakan untuk digunakan untuk melakukan operasi pengelompokan pada sebuah dataframe 
# Dataset dengan beberapa kolom dan kemudian menghitung panjang deskripsi di setiap kelompok.

Country        Total
Albania        2        1
Algeria        3        1
Argentina      3        1
Armenia        4        1
Australia      53       1
                       ..
Uganda         2        1
Ukraine        12       1
United States  126      1
Uzbekistan     13       1
Zambia         1        1
Length: 91, dtype: int64

In [15]:
# contoh 4

Data_M = Data_Country.index
type(Data_M)

# intaks ini digunakan untuk mengakses indeks dari dataframe 
# Data_Country dan kemudian memeriksa tipe objek dari indeks tersebut.

pandas.core.indexes.multi.MultiIndex